# core/settings.py

# إعدادات الشاشة
SCREEN_WIDTH = 1000
SCREEN_HEIGHT = 700
FPS = 60

# أبعاد المتاهة (حجم المربع الواحد بالـ Pixels)
TILE_SIZE = 40

# الألوان (RGB)
BG_COLOR = (30, 32, 44)       # لون الخلفية الغامق الشيك
WALL_COLOR = (43, 50, 71)     # لون الحوائط
PATH_COLOR = (20, 22, 30)     # لون الممرات الفاضية

PLAYER_COLOR = (0, 200, 150)   # لون اللاعب (تيركواز)
ENEMY_COLOR = (240, 84, 84)    # لون العدو (أحمر)

# ألوان مسارات الخوارزميات (لوضع المقارنة الـ Bonus)
BFS_COLOR = (52, 152, 219)    # أزرق
DFS_COLOR = (231, 76, 60)     # أحمر مائل للبرتقالي
ASTAR_COLOR = (46, 204, 113)  # أخضر فاتح